Repository: giellalt/corpus-nob
Catalog: tmx/sme/admin/sd/samediggi.no/utvikler-talesyntese-for-nordsamisk.html.tmx
Source language: nob
Languages: sme

source: Utvikler talesyntese for nordsamisk / Språkteknologi / Språk / Forsiden - Sametinget
sme: Hupmansyntesa davvisámegillii / Språkteknologi / Giella / Sámediggi - Sametinget

source: Utvikler talesyntese for nordsamisk
sme: Hupmansyntesa davvisámegillii

source: 22. november 2013
sme: 22. Skábmamánnu 2013

source: Sametinget har nå startet arbeidet med utvikling av talesyntese for nordsamisk.
sme: Sámediggi lea bargagoahtán hupmansyntesa ovddidemiin davvisámegiela várás.

source: Dette er et språkteknologisk verktøy for alle som har skrive- og lesevansker, samt alle andre som trenger hjelp til å lese.
sme: Dát lea ođđa giellateknologalas veahkkeneavvu buohkaide geain leat čállin- ja lohkanárut ja geat dárbbašit veahki teakstalohkamii sihke skuvllas, barggus ja priváhta.

source: - Jeg er veldig glad for at samisk språk nå også skal anvendes innenfor denne viktige teknologien.
sme: Sámediggi lea bargagoahtán hupmansyntesa ovddidemiin davvisámegiela várás.

source: Og det er jo også et verktøy som også kan benyttes av de som forsøker å lære seg samisk, feks, ved å få lest opp innhold på nett og nettaviser, sier sametingspresident Aili Keskitalo.
sme: Dát lea ođđa giellateknologalas veahkkeneavvu buohkaide geain leat čállin- ja lohkanárut ja geat dárbbašit veahki teakstalohkamii sihke skuvllas, barggus ja priváhta.

source: Talesyntese er navnet på et spesielt dataprogram, som omformer tekst til menneskelig tale.
sme: Hupmansyntesan dakkár sierralágan dihtorprográmma, mii áddestaddá olbmo hupmama.

source: Talesynteseprogrammer kan enten lese opp tekst, eller generere tale ut fra et sett av andre data.
sme: Hupmansyntesaprográmma sáhttá juogo lohkat teavstta dahje dat sáhttá buvttadit hupmama eará dieđuid vuođul.

source: Stemmen som brukes er enten kunstig (syntetisk) eller menneskelig.
sme: Jietna mii geavahuvvo lea juogo goanstadahkkon dahje olbmo suopman.

source: Utviklingsarbeidet skjer i samarbeid med Divvun og Giellatekno ved Universitetet i Tromsø.
sme: Dát dahkkojuvvo ovtta Divvumiin ja Giellateknoin Romssa universitehtas.

source: Acapela Group AB er engasjert for å løsninger for lage tekst-til-tale på nordsamisk.
sme: Fálaldagaid viežžama bokte lea Sámediggi bálkáhan Acapela Group AB ráhkadit teavsttas hupmamii čovdosiid davvisámegiela várás.

source: Utviklingsarbeidet starter i november i år. Ferdig produkt er planlagt lansert oktober 2014.
sme: Vuogádaga ráhkadeapmi álggahuvvo skábmamánus dán jagi ja gárvves buvtta almmuhuvvo jagi 2014 golggotmánus.

source: Tekst-til-tale systemet skal utvikles for generell bruk, og skal kunne lese ulike teksttyper og håndtere alle sider av den samiske gramatikken og rettskrivingen på en tilfredsstillende måte.
sme: Teavsttas-hupmamii vuogádat galgá ráhaduvvot dábálaš geavaheapmái, ja galgá sáhttit lohkat iešguđet teakstašlájaid, ja gieđahallat buot sámegiela grammatihka ja riektečállima beliid dohkálaš vugiin.
